package faang.school.projectservice.controller;

public class ProjectController {

    //Создать проект. У проекта должен назначаться владелец проекта (по умолчанию, пользователь, который создает проект),
    // должно быть название, описание. Нужно убедиться что один и тот же участник не может создавать проекты с одинаковым названием.
    // Также созданному проекту автоматически присваивается статус CREATED.


    //Обновить проект. Должна быть возможность изменять статус проекта, описание проекта.
    // При этом для аудита необходимо проставлять TIMESTAMP на каждое последние изменение проекта.


    //Получить все проекты с фильтрами по названию или статусу.
    // У проекта также должен быть признак приватности.
    // Если проект приватный, то по поиску он должен быть видим только своим участникам.


    //Получить все проекты.


    //Получить проект по id.
}
